ZONESTAR3D/ESP32_AnimatedGIF/src/ESP32_AnimatedGIF.cpp
/**
 * @file ESP32_AnimatedGIF.cpp
 * @brief Animated GIF decoder optimized for ESP32
 * @author Deepseek
 * @version 1.0.0
 * @date 2024
 * 
 * Refactored from Animated GIF decoder by Larry Bank
 */

#include "ESP32_AnimatedGIF.h"
#include <algorithm>

// ESP32 specific includes
#ifdef ESP32_ANIMATEDGIF_ESP_PLATFORM
  #include <FS.h>
  #include <SPIFFS.h>
  #include <SD.h>
  #ifdef ESP32_ANIMATEDGIF_PSRAM_SUPPORT
    #include <esp32-hal-psram.h>
  #endif
#endif

// Private implementation class
class ESP32_AnimatedGIF::Impl {
public:
    Impl() 
        : _data(nullptr)
        , _dataLength(0)
        , _dataPosition(0)
        , _reader(nullptr)
        , _readerData(nullptr)
        , _frameCallback(nullptr)
        , _pixelCallback(nullptr)
        , _callbackData(nullptr)
        , _currentFrame(0)
        , _totalFrames(0)
        , _loopCount(0)
        , _loop(true)
        , _scale(1.0f)
        , _displayWidth(0)
        , _displayHeight(0)
        , _pixelFormat(PixelFormat::RGB565_LE)
        , _usePSRAM(true)
        , _lastError(GIFError::SUCCESS)
        , _decoding(false) {
        resetState();
    }
    
    ~Impl() {
        cleanup();
    }
    
    bool begin(PixelFormat pixelFormat, bool usePSRAM) {
        _pixelFormat = pixelFormat;
        _usePSRAM = usePSRAM;
        resetState();
        _lastError = GIFError::SUCCESS;
        return true;
    }
    
    GIFError loadFromMemory(const uint8_t* data, uint32_t length) {
        cleanup();
        
        if (!data || length == 0) {
            _lastError = GIFError::INVALID_PARAMETER;
            return _lastError;
        }
        
        _data = (uint8_t*)ESP32_GIF_Utils::allocateMemory(length, _usePSRAM);
        if (!_data) {
            _lastError = GIFError::OUT_OF_MEMORY;
            return _lastError;
        }
        
        memcpy(_data, data, length);
        _dataLength = length;
        _dataPosition = 0;
        
        return parseHeader();
    }
    
    GIFError load(DataReader reader, void* userData) {
        cleanup();
        
        if (!reader) {
            _lastError = GIFError::INVALID_PARAMETER;
            return _lastError;
        }
        
        _reader = reader;
        _readerData = userData;
        
        // Read header first
        uint8_t header[13];
        if (!readData(header, 13, 0)) {
            _lastError = GIFError::FILE_NOT_FOUND;
            return _lastError;
        }
        
        // Validate GIF header
        if (memcmp(header, "GIF89a", 6) != 0 && memcmp(header, "GIF87a", 6) != 0) {
            _lastError = GIFError::BAD_FILE_FORMAT;
            return _lastError;
        }
        
        // Parse basic info
        _canvasWidth = header[6] | (header[7] << 8);
        _canvasHeight = header[8] | (header[9] << 8);
        
        if (_canvasWidth > ESP32_ANIMATEDGIF_MAX_WIDTH || _canvasHeight > ESP32_ANIMATEDGIF_MAX_HEIGHT) {
            _lastError = GIFError::FILE_TOO_WIDE;
            return _lastError;
        }
        
        uint8_t flags = header[10];
        _backgroundColor = header[11];
        
        // Check for global color table
        if (flags & 0x80) {
            uint8_t colorTableBits = (flags & 0x07) + 1;
            _globalColorTableSize = 1 << colorTableBits;
            _globalColorTable = (uint32_t*)ESP32_GIF_Utils::allocateMemory(
                _globalColorTableSize * 3, _usePSRAM);
            
            if (_globalColorTable) {
                readData((uint8_t*)_globalColorTable, _globalColorTableSize * 3, 13);
            }
        }
        
        _lastError = GIFError::SUCCESS;
        return _lastError;
    }
    
    void setDisplaySize(uint16_t width, uint16_t height) {
        _displayWidth = width;
        _displayHeight = height;
    }
    
    void setFrameCallback(FrameCallback callback, void* userData) {
        _frameCallback = callback;
        _callbackData = userData;
    }
    
    void setPixelCallback(PixelCallback callback, void* userData) {
        _pixelCallback = callback;
        _callbackData = userData;
    }
    
    bool getInfo(GIFInfo& info) {
        info.width = _canvasWidth;
        info.height = _canvasHeight;
        info.frameCount = _totalFrames;
        info.totalDuration = _totalDuration;
        info.loopCount = _loopCount;
        info.hasTransparency = _hasTransparency;
        info.backgroundColor = _backgroundColor;
        info.transparentIndex = _transparentIndex;
        return true;
    }
    
    bool getFrameInfo(FrameInfo& info) {
        info.x = _frameX;
        info.y = _frameY;
        info.width = _frameWidth;
        info.height = _frameHeight;
        info.delay = _frameDelay;
        info.disposal = static_cast<DisposalMethod>(_disposalMethod);
        info.interlace = (_imageFlags & 0x40) != 0;
        return true;
    }
    
    GIFError nextFrame(bool syncDelay) {
        if (_lastError != GIFError::SUCCESS) {
            return _lastError;
        }
        
        // Check if we need to restart
        if (_currentFrame >= _totalFrames && _loop) {
            reset();
        } else if (_currentFrame >= _totalFrames) {
            _lastError = GIFError::EMPTY_FRAME;
            return _lastError;
        }
        
        // Parse frame if not already parsed
        if (!parseFrame()) {
            return _lastError;
        }
        
        // Decode frame
        if (!decodeFrame()) {
            return _lastError;
        }
        
        // Apply disposal method
        applyDisposal();
        
        _currentFrame++;
        
        // Wait for frame delay if requested
        if (syncDelay && _frameDelay > 0) {
            delay(_frameDelay);
        }
        
        return GIFError::SUCCESS;
    }
    
    void reset() {
        _dataPosition = 0;
        _currentFrame = 0;
        resetFrameBuffer();
        parseHeader(); // Reset to beginning
    }
    
    GIFError getLastError() const {
        return _lastError;
    }
    
    uint16_t getCurrentFrame() const {
        return _currentFrame;
    }
    
