ZONESTAR3D/ESP32_AnimatedGIF/src/ESP32_AnimatedGIF.cpp
    uint16_t getFrameCount() const {
        return _totalFrames;
    }
    
    bool isAnimationComplete() const {
        return !_loop && _currentFrame >= _totalFrames;
    }
    
    void setLoop(bool loop) {
        _loop = loop;
    }
    
    void setScale(float scale) {
        _scale = std::max(0.1f, std::min(scale, 10.0f));
    }
    
    uint16_t getCanvasWidth() const {
        return _canvasWidth;
    }
    
    uint16_t getCanvasHeight() const {
        return _canvasHeight;
    }
    
private:
    // Data management
    uint8_t* _data;
    uint32_t _dataLength;
    uint32_t _dataPosition;
    DataReader _reader;
    void* _readerData;
    
    // Callbacks
    FrameCallback _frameCallback;
    PixelCallback _pixelCallback;
    void* _callbackData;
    
    // GIF state
    uint16_t _canvasWidth;
    uint16_t _canvasHeight;
    uint16_t _currentFrame;
    uint16_t _totalFrames;
    uint16_t _loopCount;
    bool _loop;
    float _scale;
    uint16_t _displayWidth;
    uint16_t _displayHeight;
    PixelFormat _pixelFormat;
    bool _usePSRAM;
    GIFError _lastError;
    bool _decoding;
    
    // Frame state
    uint16_t _frameX;
    uint16_t _frameY;
    uint16_t _frameWidth;
    uint16_t _frameHeight;
    uint16_t _frameDelay;
    uint8_t _disposalMethod;
    uint8_t _imageFlags;
    bool _hasTransparency;
    uint8_t _transparentIndex;
    uint8_t _backgroundColor;
    
    // Color tables
    uint32_t* _globalColorTable;
    uint32_t* _localColorTable;
    uint16_t _globalColorTableSize;
    uint16_t _localColorTableSize;
    
    // Buffers
    uint8_t* _frameBuffer;
    uint8_t* _previousFrame;
    uint32_t _totalDuration;
    
    void resetState() {
        _canvasWidth = 0;
        _canvasHeight = 0;
        _currentFrame = 0;
        _totalFrames = 0;
        _loopCount = 0;
        _totalDuration = 0;
        
        resetFrameState();
        
        _globalColorTable = nullptr;
        _localColorTable = nullptr;
        _globalColorTableSize = 0;
        _localColorTableSize = 0;
        
        _frameBuffer = nullptr;
        _previousFrame = nullptr;
    }
    
    void resetFrameState() {
        _frameX = 0;
        _frameY = 0;
        _frameWidth = 0;
        _frameHeight = 0;
        _frameDelay = 0;
        _disposalMethod = 0;
        _imageFlags = 0;
        _hasTransparency = false;
        _transparentIndex = 0;
    }
    
    void cleanup() {
        if (_data) {
            ESP32_GIF_Utils::freeMemory(_data);
            _data = nullptr;
        }
        
        if (_globalColorTable) {
            ESP32_GIF_Utils::freeMemory(_globalColorTable);
            _globalColorTable = nullptr;
        }
        
        if (_localColorTable) {
            ESP32_GIF_Utils::freeMemory(_localColorTable);
            _localColorTable = nullptr;
        }
        
        if (_frameBuffer) {
            ESP32_GIF_Utils::freeMemory(_frameBuffer);
            _frameBuffer = nullptr;
        }
        
        if (_previousFrame) {
            ESP32_GIF_Utils::freeMemory(_previousFrame);
            _previousFrame = nullptr;
        }
        
        resetState();
    }
    
    bool readData(uint8_t* buffer, uint32_t length, uint32_t position) {
        if (_reader) {
            return _reader(_readerData, buffer, length, position);
        } else if (_data) {
            if (position + length > _dataLength) {
                return false;
            }
            memcpy(buffer, _data + position, length);
            return true;
        }
        return false;
    }
    
    GIFError parseHeader() {
        uint8_t header[13];
        if (!readData(header, 13, 0)) {
            _lastError = GIFError::FILE_NOT_FOUND;
            return _lastError;
        }
        
        // Validate GIF signature
        if (memcmp(header, "GIF89a", 6) != 0 && memcmp(header, "GIF87a", 6) != 0) {
            _lastError = GIFError::BAD_FILE_FORMAT;
            return _lastError;
        }
        
        _canvasWidth = header[6] | (header[7] << 8);
        _canvasHeight = header[8] | (header[9] << 8);
        
        if (_canvasWidth > ESP32_ANIMATEDGIF_MAX_WIDTH || _canvasHeight > ESP32_ANIMATEDGIF_MAX_HEIGHT) {
            _lastError = GIFError::FILE_TOO_WIDE;
            return _lastError;
        }
        
        uint8_t flags = header[10];
        _backgroundColor = header[11];
        
        // Parse global color table if present
        _dataPosition = 13;
        if (flags & 0x80) {
            uint8_t colorTableBits = (flags & 0x07) + 1;
            _globalColorTableSize = 1 << colorTableBits;
            
            _globalColorTable = (uint32_t*)ESP32_GIF_Utils::allocateMemory(
                _globalColorTableSize * 3, _usePSRAM);
            
            if (_globalColorTable) {
                if (!readData((uint8_t*)_globalColorTable, _globalColorTableSize * 3, _dataPosition)) {
                    _lastError = GIFError::EARLY_EOF;
                    return _lastError;
                }
                _dataPosition += _globalColorTableSize * 3;
            }
        }
        
        // Parse frames to count them
        countFrames();
        
        // Allocate frame buffer
        allocateFrameBuffer();
        
        _lastError = GIFError::SUCCESS;
        return _lastError;
    }
    
    void countFrames() {
        uint32_t pos = _dataPosition;
        uint8_t block[256];
        _totalFrames = 0;
        _totalDuration = 0;
        
        while (pos < _dataLength - 1) {
            if (!readData(block, 1, pos)) break;
            
            if (block[0] == 0x2C) { // Image descriptor
                _totalFrames++;
                pos += 10; // Skip image descriptor
                
                // Skip local color table if present
                if (!readData(block, 1, pos)) break;
                if (block[0] & 0x80) {
                    uint8_t colorTableBits = (block[0] & 0x07) + 1;
                    uint16_t colorTableSize = 1 << colorTableBits;
                    pos += colorTableSize * 3 + 1;
                } else {
                    pos += 1;
                }
                
