ZONESTAR3D/ESP32_AnimatedGIF/src/ESP32_AnimatedGIF.cpp
                // Skip image data
                while (pos < _dataLength) {
                    if (!readData(block, 1, pos)) break;
                    uint8_t subBlockSize = block[0];
                    pos += 1;
                    
                    if (subBlockSize == 0) break;
                    pos += subBlockSize;
                }
            } else if (block[0] == 0x21) { // Extension block
                pos += 1;
                if (!readData(block, 1, pos)) break;
                uint8_t extensionType = block[0];
                pos += 1;
                
                if (extensionType == 0xF9) { // Graphics control extension
                    if (!readData(block, 5, pos)) break;
                    uint16_t delay = (block[2] << 8) | block[1];
                    if (delay < 2) delay = 2; // Minimum delay
                    _totalDuration += delay * 10; // Convert to milliseconds
                    pos += 5;
                }
                
                // Skip extension data
                while (pos < _dataLength) {
                    if (!readData(block, 1, pos)) break;
                    uint8_t subBlockSize = block[0];
                    pos += 1;
                    
                    if (subBlockSize == 0) break;
                    pos += subBlockSize;
                }
            } else if (block[0] == 0x3B) { // Trailer
                break;
            } else {
                pos += 1;
            }
        }
        
        _dataPosition = 13 + (_globalColorTableSize * 3);
    }
    
    void allocateFrameBuffer() {
        if (_frameBuffer) {
            ESP32_GIF_Utils::freeMemory(_frameBuffer);
        }
        
        if (_previousFrame) {
            ESP32_GIF_Utils::freeMemory(_previousFrame);
        }
        
        size_t bufferSize = _canvasWidth * _canvasHeight;
        switch (_pixelFormat) {
            case PixelFormat::RGB565_LE:
            case PixelFormat::RGB565_BE:
                bufferSize *= 2;
                break;
            case PixelFormat::RGB888:
                bufferSize *= 3;
                break;
            case PixelFormat::ARGB8888:
                bufferSize *= 4;
                break;
            default:
                // 1 byte per pixel for others
                break;
        }
        
        _frameBuffer = (uint8_t*)ESP32_GIF_Utils::allocateMemory(bufferSize, _usePSRAM);
        _previousFrame = (uint8_t*)ESP32_GIF_Utils::allocateMemory(bufferSize, _usePSRAM);
        
        if (_frameBuffer && _previousFrame) {
            memset(_frameBuffer, 0, bufferSize);
            memset(_previousFrame, 0, bufferSize);
        }
    }
    
    void resetFrameBuffer() {
        if (_frameBuffer && _previousFrame) {
            size_t bufferSize = _canvasWidth * _canvasHeight;
            switch (_pixelFormat) {
                case PixelFormat::RGB565_LE:
                case PixelFormat::RGB565_BE:
                    bufferSize *= 2;
                    break;
                case PixelFormat::RGB888:
                    bufferSize *= 3;
                    break;
                case PixelFormat::ARGB8888:
                    bufferSize *= 4;
                    break;
                default:
                    break;
            }
            memset(_frameBuffer, 0, bufferSize);
            memset(_previousFrame, 0, bufferSize);
        }
    }
    
    bool parseFrame() {
        uint8_t block[256];
        resetFrameState();
        
        while (_dataPosition < _dataLength) {
            if (!readData(block, 1, _dataPosition)) {
                _lastError = GIFError::EARLY_EOF;
                return false;
            }
            
            if (block[0] == 0x21) { // Extension block
                _dataPosition += 1;
                if (!readData(block, 1, _dataPosition)) {
                    _lastError = GIFError::EARLY_EOF;
                    return false;
                }
                
                uint8_t extensionType = block[0];
                _dataPosition += 1;
                
                if (extensionType == 0xF9) { // Graphics control extension
                    if (!readData(block, 5, _dataPosition)) {
                        _lastError = GIFError::EARLY_EOF;
                        return false;
                    }
                    
                    uint8_t packed = block[0];
                    _disposalMethod = (packed >> 2) & 0x07;
                    _hasTransparency = (packed & 0x01) != 0;
                    _frameDelay = ((block[2] << 8) | block[1]) * 10; // Convert to ms
                    if (_frameDelay < 20) _frameDelay = 20; // Minimum 20ms
                    _transparentIndex = block[3];
                    
                    _dataPosition += 5;
                }
                
                // Skip extension data
                while (true) {
                    if (!readData(block, 1, _dataPosition)) {
                        _lastError = GIFError::EARLY_EOF;
                        return false;
                    }
                    uint8_t subBlockSize = block[0];
                    _dataPosition += 1;
                    
                    if (subBlockSize == 0) break;
                    _dataPosition += subBlockSize;
                }
            } else if (block[0] == 0x2C) { // Image descriptor
                // Parse image descriptor
                if (!readData(block, 9, _dataPosition + 1)) {
                    _lastError = GIFError::EARLY_EOF;
                    return false;
                }
                
                _frameX = block[0] | (block[1] << 8);
                _frameY = block[2] | (block[3] << 8);
                _frameWidth = block[4] | (block[5] << 8);
                _frameHeight = block[6] | (block[7] << 8);
                _imageFlags = block[8];
                
                _dataPosition += 10;
                
                // Parse local color table if present
                if (_imageFlags & 0x80) {
                    uint8_t colorTableBits = (_imageFlags & 0x07) + 1;
                    _localColorTableSize = 1 << colorTableBits;
                    
                    if (_localColorTable) {
                        ESP32_GIF_Utils::freeMemory(_localColorTable);
                    }
                    
