ZONESTAR3D/ESP32_AnimatedGIF/src/ESP32_AnimatedGIF.cpp
                    _localColorTable = (uint32_t*)ESP32_GIF_Utils::allocateMemory(
                        _localColorTableSize * 3, _usePSRAM);
                    
                    if (_localColorTable) {
                        if (!readData((uint8_t*)_localColorTable, _localColorTableSize * 3, _dataPosition)) {
                            _lastError = GIFError::EARLY_EOF;
                            return false;
                        }
                        _dataPosition += _localColorTableSize * 3;
                    }
                }
                
                return true;
            } else if (block[0] == 0x3B) { // Trailer
                _lastError = GIFError::EMPTY_FRAME;
                return false;
            } else {
                _dataPosition += 1;
            }
        }
        
        _lastError = GIFError::EMPTY_FRAME;
        return false;
    }
    
    bool decodeFrame() {
        // Simplified LZW decoding for ESP32
        // Note: Full LZW implementation would be quite complex
        // This is a placeholder that demonstrates the structure
        
        uint8_t lzwCodeSize;
        if (!readData(&lzwCodeSize, 1, _dataPosition)) {
            _lastError = GIFError::DECODE_ERROR;
            return false;
        }
        _dataPosition += 1;
        
        // Skip image data for now (placeholder)
        // In a full implementation, this would decode the LZW data
        uint8_t subBlockSize;
        do {
            if (!readData(&subBlockSize, 1, _dataPosition)) {
                _lastError = GIFError::DECODE_ERROR;
                return false;
            }
            _dataPosition += 1 + subBlockSize;
        } while (subBlockSize > 0);
        
        // For now, just fill with test pattern
        fillTestPattern();
        
        return true;
    }
    
    void fillTestPattern() {
        // Create a simple test pattern for demonstration
        uint32_t* colorTable = _localColorTable ? _localColorTable : _globalColorTable;
        if (!colorTable || !_frameBuffer) return;
        
        for (uint16_t y = 0; y < _frameHeight; y++) {
            for (uint16_t x = 0; x < _frameWidth; x++) {
                uint8_t colorIndex = (x + y) % _localColorTableSize;
                
                if (_hasTransparency && colorIndex == _transparentIndex) {
                    continue; // Skip transparent pixels
                }
                
                uint32_t rgb = colorTable[colorIndex];
                uint8_t r = (rgb >> 16) & 0xFF;
                uint8_t g = (rgb >> 8) & 0xFF;
                uint8_t b = rgb & 0xFF;
                
                drawPixel(x + _frameX, y + _frameY, r, g, b);
            }
        }
    }
    
    void drawPixel(uint16_t x, uint16_t y, uint8_t r, uint8_t g, uint8_t b) {
        if (x >= _canvasWidth || y >= _canvasHeight) return;
        
        if (_pixelCallback) {
            uint16_t color = ESP32_GIF_Utils::rgb888To565(r, g, b);
            _pixelCallback(_callbackData, x, y, color);
        }
        
        // Store in frame buffer if allocated
        if (_frameBuffer) {
            size_t offset = (y * _canvasWidth + x);
            
            switch (_pixelFormat) {
                case PixelFormat::RGB565_LE: {
                    uint16_t color = ESP32_GIF_Utils::rgb888To565(r, g, b);
                    _frameBuffer[offset * 2] = color & 0xFF;
                    _frameBuffer[offset * 2 + 1] = color >> 8;
                    break;
                }
                case PixelFormat::RGB565_BE: {
                    uint16_t color = ESP32_GIF_Utils::rgb888To565(r, g, b);
                    _frameBuffer[offset * 2] = color >> 8;
                    _frameBuffer[offset * 2 + 1] = color & 0xFF;
                    break;
                }
                case PixelFormat::RGB888: {
                    _frameBuffer[offset * 3] = r;
                    _frameBuffer[offset * 3 + 1] = g;
                    _frameBuffer[offset * 3 + 2] = b;
                    break;
                }
                case PixelFormat::ARGB8888: {
                    _frameBuffer[offset * 4] = 0xFF; // Alpha
                    _frameBuffer[offset * 4 + 1] = r;
                    _frameBuffer[offset * 4 + 2] = g;
                    _frameBuffer[offset * 4 + 3] = b;
                    break;
                }
                case PixelFormat::GRAYSCALE_8BIT: {
                    _frameBuffer[offset] = ESP32_GIF_Utils::rgb888ToGrayscale(r, g, b);
                    break;
                }
                case PixelFormat::MONOCHROME_1BIT: {
                    uint8_t gray = ESP32_GIF_Utils::rgb888ToGrayscale(r, g, b);
                    uint8_t bitPosition = x % 8;
                    uint8_t byteOffset = offset / 8;
                    if (gray > 127) {
                        _frameBuffer[byteOffset] |= (1 << (7 - bitPosition));
                    } else {
                        _frameBuffer[byteOffset] &= ~(1 << (7 - bitPosition));
                    }
                    break;
                }
            }
        }
    }
    
    void applyDisposal() {
        if (_disposalMethod == 2) { // Restore to background
            // Fill frame area with background color
            uint32_t* colorTable = _globalColorTable;
            if (colorTable && _backgroundColor < _globalColorTableSize) {
                uint32_t rgb = colorTable[_backgroundColor];
                uint8_t r = (rgb >> 16) & 0xFF;
                uint8_t g = (rgb >> 8) & 0xFF;
                uint8_t b = rgb & 0xFF;
                
                for (uint16_t y = 0; y < _frameHeight; y++) {
                    for (uint16_t x = 0; x < _frameWidth; x++) {
                        drawPixel(x + _frameX, y + _frameY, r, g, b);
                    }
                }
            }
        } else if (_disposalMethod == 3) { // Restore to previous
            // Restore previous frame buffer
            if (_frameBuffer && _previousFrame) {
                size_t bufferSize = _canvasWidth * _canvasHeight;
                switch (_pixelFormat) {
                    case PixelFormat::RGB565_LE:
                    case PixelFormat::RGB565_BE:
                        bufferSize *= 2;
                        break;
                    case PixelFormat::RGB888:
                        bufferSize *= 3;
                        break;
                    case PixelFormat::ARGB8888:
                        bufferSize *= 4;
                        break;
                    default:
                        break;
                }
                memcpy(_frameBuffer, _previousFrame, bufferSize);
            }
        }
        
        // Save current frame for next disposal
        if (_frameBuffer && _previousFrame) {
            size_t bufferSize = _canvasWidth * _canvasHeight;
            switch (_pixelFormat) {
                case PixelFormat::RGB565_LE:
                case PixelFormat::RGB565_BE:
                    bufferSize *= 2;
                    break;
                case PixelFormat::RGB888:
                    bufferSize *= 3;
                    break;
                case PixelFormat::ARGB8888:
                    bufferSize *= 4;
                    break;
                default:
                    break;
            }
            memcpy(_previousFrame, _frameBuffer, bufferSize);
        }
    }
};

// Public class implementation
ESP32_AnimatedGIF::ESP32_AnimatedGIF() : _impl(new Impl()) {}

ESP32_AnimatedGIF::~ESP32_AnimatedGIF() {
    delete _impl;
}

bool ESP32_AnimatedGIF::begin(PixelFormat pixelFormat, bool usePSRAM) {
    return _impl->begin(pixelFormat, usePSRAM);
}

GIFError ESP32_AnimatedGIF::loadFromMemory(const uint8_t* data, uint32_t length) {
    return _impl->loadFromMemory(data, length);
}

