ZONESTAR3D/ESP32_AnimatedGIF/src/ESP32_AnimatedGIF.cpp
GIFError ESP32_AnimatedGIF::load(DataReader reader, void* userData) {
    return _impl->load(reader, userData);
}

void ESP32_AnimatedGIF::setDisplaySize(uint16_t width, uint16_t height) {
    _impl->setDisplaySize(width, height);
}

void ESP32_AnimatedGIF::setFrameCallback(FrameCallback callback, void* userData) {
    _impl->setFrameCallback(callback, userData);
}

void ESP32_AnimatedGIF::setPixelCallback(PixelCallback callback, void* userData) {
    _impl->setPixelCallback(callback, userData);
}

bool ESP32_AnimatedGIF::getInfo(GIFInfo& info) {
    return _impl->getInfo(info);
}

bool ESP32_AnimatedGIF::getFrameInfo(FrameInfo& info) {
    return _impl->getFrameInfo(info);
}

GIFError ESP32_AnimatedGIF::nextFrame(bool syncDelay) {
    return _impl->nextFrame(syncDelay);
}

void ESP32_AnimatedGIF::reset() {
    _impl->reset();
}

GIFError ESP32_AnimatedGIF::getLastError() const {
    return _impl->getLastError();
}

const char* ESP32_AnimatedGIF::getErrorMessage(GIFError error) {
    switch (error) {
        case GIFError::SUCCESS: return "Success";
        case GIFError::DECODE_ERROR: return "Decode error";
        case GIFError::FILE_TOO_WIDE: return "File too wide";
        case GIFError::INVALID_PARAMETER: return "Invalid parameter";
        case GIFError::UNSUPPORTED_FEATURE: return "Unsupported feature";
        case GIFError::FILE_NOT_FOUND: return "File not found";
        case GIFError::EARLY_EOF: return "Early end of file";
        case GIFError::EMPTY_FRAME: return "Empty frame";
        case GIFError::BAD_FILE_FORMAT: return "Bad file format";
        case GIFError::OUT_OF_MEMORY: return "Out of memory";
        case GIFError::DISPLAY_NOT_SET: return "Display not set";
        case GIFError::UNKNOWN_ERROR: return "Unknown error";
        default: return "Unknown error code";
    }
}

uint16_t ESP32_AnimatedGIF::getCurrentFrame() const {
    return _impl->getCurrentFrame();
}

uint16_t ESP32_AnimatedGIF::getFrameCount() const {
    return _impl->getFrameCount();
}

bool ESP32_AnimatedGIF::isAnimationComplete() const {
    return _impl->isAnimationComplete();
}

void ESP32_AnimatedGIF::setLoop(bool loop) {
    _impl->setLoop(loop);
}

void ESP32_AnimatedGIF::setScale(float scale) {
    _impl->setScale(scale);
}

uint16_t ESP32_AnimatedGIF::getCanvasWidth() const {
    return _impl->getCanvasWidth();
}

uint16_t ESP32_AnimatedGIF::getCanvasHeight() const {
    return _impl->getCanvasHeight();
}

// Utility functions implementation
namespace ESP32_GIF_Utils {
    
    void* allocateMemory(size_t size, bool usePSRAM) {
        if (size == 0) return nullptr;
        
#ifdef ESP32_ANIMATEDGIF_PSRAM_SUPPORT
        if (usePSRAM && psramFound()) {
            void* ptr = ps_malloc(size);
            if (ptr) {
                memset(ptr, 0, size);
                return ptr;
            }
        }
#endif
        
        void* ptr = malloc(size);
        if (ptr) {
            memset(ptr, 0, size);
        }
        return ptr;
    }
    
    void freeMemory(void* ptr) {
        if (ptr) {
            free(ptr);
        }
    }
    
    uint16_t rgb888To565(uint8_t r, uint8_t g, uint8_t b) {
        return ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
    }
    
    uint8_t rgb888ToGrayscale(uint8_t r, uint8_t g, uint8_t b) {
        // Using luminance formula: Y = 0.299R + 0.587G + 0.114B
        return (uint8_t)((r * 77 + g * 150 + b * 29) >> 8);
    }
}